[{"type": "video", "transcription": ""}, {"type": "video", "transcription": ""}, {"type": "video", "transcription": ""}, {"type": "video", "transcription": ""}, {"type": "video", "transcription": ""}, {"type": "video", "transcription": "[00:00:00 - 00:00:30] After reading tons of productivity books, I came across so many rules like the two year rule, the five minute rule, the 5 second rule. No, not that 5 second rule. The problem is that these rules are meant for companies or entrepreneurs. But I was able to adapt into my studies during Med school and drastically cut down in my procrastination. So I'm going to share with you two different 2 minute rules for the next two minutes. The 1st 2 minute rule comes from Getting Things Done by David Allen. He says if it takes 2 minutes to do, get it done right now.\n--------------------------------------------------\n[00:00:30 - 00:01:00] For example, if I need to take out the trash today, it takes 2 minutes to do so. If I'm thinking about it now, might as well just do it now instead of writing it down on A to do list or probably forgetting about it or having to come back to it later, which takes more than two minutes. That's how I see it. So here's a list of things that might take two minutes throughout the day, like organizing your desk or watering your plants or clipping those nasty nails. I just do it when I notice it. But these little things start to add up, so this rule biases my brain towards taking action.\n--------------------------------------------------\n[00:01:00 - 00:01:30] Away from procrastination, the second two-minute rule comes from Atomic Habits by James Clear. He says when you're trying to do something you don't really want to do, simplify the task down to two minutes or less. So doing your entire reading assignment becomes just reading one paragraph or memorizing the entire periodic table becomes memorizing just 10 flash cards. Now some of you might think, yeah, this is just a Jedi mind trick. Like why would I fall for it? How is this at all sustainable? And to that he says, when you're starting out, limit yourself to only.\n--------------------------------------------------\n[00:01:30 - 00:02:00] Two minutes. So back in Med school, I wanted to build a habit of studying for one hour every day before dinner. So I tried this trick. But I lived in myself to just two minutes. I'd sit down, open my laptop, study for two minutes, and then close my laptop and went to do something else. It seems unproductive at first, right? It seems stupid. But staying consistent with this 2 minute routine day after day meant that I was becoming the type of person who studies daily. I was mastering the habit of just showing.\n--------------------------------------------------\n[00:02:00 - 00:02:26] Up because a habit needs to be established before it can be expanded upon. If I can't become a person who studies for justice 2 minutes a day, I'd never be able to become the person that studies for an hour a day. You got to start somewhere, but starting small is easier. There's a lot of other useful tips from books. I cover more here in this video on three books in 3 minutes. Check it out and if you guys like these types of videos, let me know in the comments below. I'll see you there. Bye.\n--------------------------------------------------\n", "file": "FreddyDubon.mp4"}]